<a href="https://colab.research.google.com/github/kunamneni117/Introduction-To-Machine-Learning/blob/master/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib as mpl
from sklearn.preprocessing import *

In [0]:
def Load_Titanic_Dataset(path):
  return pd.read_csv(path)

In [0]:
Titanic_Data_Path='/content/train.csv'
Titanic_Data =Load_Titanic_Dataset(Titanic_Data_Path)

In [8]:
Titanic_Data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [9]:
Titanic_Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [10]:
Titanic_Data.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [12]:
Titanic_Data['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [14]:
Titanic_Data['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [15]:
Titanic_Data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [16]:
Titanic_Data['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

The Embarked attribute tells us where the passenger embarked: C=Cherbourg, Q=Queenstown, S=Southampton.

In [0]:
from sklearn.pipeline import Pipeline,FeatureUnion

In [19]:
! pip install sklearn_features

Requirement already satisfied: sklearn_features in /usr/local/lib/python3.6/dist-packages (0.0.2)
Requirement already satisfied: scikit-learn in /usr/local/lib/python3.6/dist-packages (from sklearn_features) (0.21.3)
Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (from sklearn_features) (0.24.2)
Requirement already satisfied: scipy in /usr/local/lib/python3.6/dist-packages (from sklearn_features) (1.3.1)
Requirement already satisfied: joblib>=0.11 in /usr/local/lib/python3.6/dist-packages (from scikit-learn->sklearn_features) (0.13.2)
Requirement already satisfied: numpy>=1.11.0 in /usr/local/lib/python3.6/dist-packages (from scikit-learn->sklearn_features) (1.16.4)
Requirement already satisfied: python-dateutil>=2.5.0 in /usr/local/lib/python3.6/dist-packages (from pandas->sklearn_features) (2.5.3)
Requirement already satisfied: pytz>=2011k in /usr/local/lib/python3.6/dist-packages (from pandas->sklearn_features) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.5.0->pandas->sklearn_features) (1.12.0)

In [0]:
from sklearn_features.transformers import DataFrameSelector

In [0]:
from sklearn.base import BaseEstimator,TransformerMixin

In [0]:
class Custom_DataFrameSelector(BaseEstimator,TransformerMixin):
  def __init__(self,attributes):
    self.attributes=attributes
  def fit(self,X,y=None):
    return self
  def transform(self,X,y=None):
    return X[self.attributes]

Testing the Custom Dataframe Selector Using a Dataframe

In [0]:
Titanic_Data.columns
Test_Columns=['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex']

In [0]:
Testing = Custom_DataFrameSelector(Test_Columns)

In [27]:
Testing.fit_transform(Titanic_Data).head()

   PassengerId  ...     Sex
0            1  ...    male
1            2  ...  female
2            3  ...  female
3            4  ...  female
4            5  ...    male

[5 rows x 5 columns]

Its Worked .......Hurray

In [0]:
try:
  from sklearn.preprocessing import SimpleImputer 
except ImportError:
  from sklearn.preprocessing import Imputer as SimpleImputer

In [29]:
Titanic_Data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [0]:
Titanic_Features_Numericals_Columns = ["Age", "SibSp", "Parch", "Fare"]

In [0]:
Titanic_Data_Features = Titanic_Data.drop('Survived',axis =1)
Titanic_Data_Features= Titanic_Data_Features.drop(['PassengerId','Name','Ticket','Cabin'],axis=1)

In [0]:
Titanic_Data_Labels = Titanic_Data[['Survived']]

In [39]:
list(Titanic_Data_Features)

['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked']

In [45]:
Titanic_Features_Numericals_Columns

['Age', 'SibSp', 'Parch', 'Fare']

In [47]:
Numerical_Pipeline = Pipeline([
                               ('Select_Numerical_Columns',Custom_DataFrameSelector(Titanic_Features_Numericals_Columns)),
                                ('imputer',SimpleImputer(strategy='median')),
                   ])

/usr/local/lib/python3.6/dist-packages/sklearn/utils/deprecation.py:66: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

In [48]:
Numerical_Pipeline.fit_transform(Titanic_Data_Features)

array([[22.    ,  1.    ,  0.    ,  7.25  ],
       [38.    ,  1.    ,  0.    , 71.2833],
       [26.    ,  0.    ,  0.    ,  7.925 ],
       ...,
       [28.    ,  1.    ,  2.    , 23.45  ],
       [26.    ,  0.    ,  0.    , 30.    ],
       [32.    ,  0.    ,  0.    ,  7.75  ]])